app/Bll/Lang.php

select * from `languages`
---
    public static function getLanguages()
    {
        $languages = Language::all();

select * from `languages` where `code` = 'ar' limit 1
---
    public static function get_language_title()
    {
        $language = Language::where('code', session('locale'))->first();

select * from `languages` where `code` != 'ar'
---
    public static function anotherLang()
    {
        $code = session('locale');
        $language = Language::where('code','!=',$code )->get();

select * from `languages` where `code` is null limit 1
select * from `languages` limit 1
---
    public static function getSelectedLangId()
    {
        $language = Language::where('code', session('locale'))->first();
        if ($language == null)
            return Language::first()->id;

select * from `languages` where `code` is null limit 1
select * from `languages` limit 1
---
    public static function getLang($session)
    {
        $language = Language::where('code', $session)->first();
        if ($language == null) {
            return $language = Language::first()->id;