app/Bll/Order.php

    public function BankTransfer()
    {
        $transaction = transactions::create([

            'order_id' => $this->order->id,
            'type_id' => null,
            'type' => $this->payment_type,
            'status' => 'pending',
            'bank_id' => $this->payment_type,
            'payment_gateway' => $this->payment_type,
            'total' => $this->total,
            'user_id' => $this->user->id
        ]);
---
select count(*) as aggregate from `orders`