app/Bll/Utility.php

select * from `lists`
---
    public static function footerLink()
    {
        $list =  ItemsList::get();

select `settings_data`.`id`, `settings_data`.`title`, `settings`.`id` as `setting_id`, `settings_data`.`lang_id`, `settings`.`logo`, `settings`.`facebook_url`, `settings`.`twitter_url`, `settings`.`instagram_url`, `settings`.`order_accept`, `settings`.`product_rating`, `settings`.`product_outStock`, `settings`.`discount_codes`, `settings`.`similar_products` from `settings` inner join `settings_data` on `settings`.`id` = `settings_data`.`setting_id` where `settings_data`.`lang_id` = 1 limit 1
---
    public static function get_main_settings()
    {
        if (session("setting") != null)
            return session("setting");
        $setting = \App\Setting::join('settings_data', 'settings.id', 'settings_data.setting_id')
            ->select(
                'settings_data.id',
                'settings_data.title',
                'settings.id as setting_id',
                'settings_data.lang_id',
                'settings.logo',
                'settings.facebook_url',
                'settings.twitter_url',
                'settings.instagram_url',
                'settings.order_accept',
                'settings.product_rating',
                'settings.product_outStock',
                'settings.discount_codes',
                'settings.similar_products',
            )
            ->where('settings_data.lang_id', Lang::getSelectedLangId())
            ->first();

select * from `settings` inner join `settings_data` on `settings`.`id` = `settings_data`.`setting_id` where `settings_data`.`lang_id` = 2 limit 1
---
    public static function get_site_settings()
    {
        $settings = Setting::join('settings_data', 'settings.id', 'settings_data.setting_id')
            ->where('settings_data.lang_id', Lang::getSelectedLangId())
            ->first();

select * from `default_images` limit 1
select `image_account` from `image_accounts` limit 1
---
    public static function get_default_images()
    {
        $images = DefaultImage::first();

        $user_image = ImageAccount::value('image_account');

select * from `settings` limit 1
---
    public static function taxOnProduct()
    {
        $settings = Setting::first();