app/Modules/Admin/Models/Section.php

    public function productsRelations($total = true)
    {
        if ($this->type == 'latest_products') {
            $categories = $this->categories->pluck('id');
---
select `categories`.*, `section_category`.`section_id` as `pivot_section_id`, `section_category`.`category_id` as `pivot_category_id` from `categories` inner join `section_category` on `categories`.`id` = `section_category`.`category_id` where `section_category`.`section_id` = 228