app/Modules/Admin/Controllers/Product/ProductController.php

    public function image_save(Request $request, $id)
    {
        $id = $request->product_id;
        $imageExtensions = ['jpg', 'jpeg', 'png', 'PNG', 'JPG', 'JPEG'];
        $fileExtensions = ['zip', 'ZIP'];
        $product = products::find($id);
---
select * from `products` where `products`.`id` = '2323' limit 1

    public function index(ProductsDataTable $products)
    {
        //        dd('asas');
        // $flyers=Flyer::all();
        $countries = countries_data::where('lang_id', Lang::getSelectedLangId())->get()->pluck('title', 'country_id');
        $flyers = FlyerData::where('lang_id', Lang::getSelectedLangId())->get()->pluck('title', 'flyer_id');
        // $categories=CategoryData::where('lang_id',getLang())->get()->pluck('title','category_id');
        //        $test = Category::query()->groupBy('level')->get()->pluck('level');
        //        $again = Category::query()->whereIn('level', $test)->get();
        //        dd($test, $again);
        $categories = Category::with('data')
            ->orderBy('level')
            ->get()
            ->groupBy('level')
            ->map(function ($query) {
                return $query->keyBy('id');
            });
        //        $categories = Category::leftJoin('categories_data', 'categories_data.category_id', 'categories.id')
        //            ->select('categories.*', 'categories_data.title as title', 'categories_data.lang_id as lang_id')
        //            ->orderByDesc('categories.id')
        //            ->where('categories_data.lang_id', Lang::getSelectedLangId())
        //            ->where('categories.container_type', 'products')
        //            ->get();
        //$brands=Brand::all();
        $brands = Brand::select('brands.id', 'brands_data.name')
            ->join('brands_data', 'brands.id', 'brands_data.brand_id')
            ->where('lang_id', Lang::getSelectedLangId())
            ->get();
        $classifications = DB::table('classifications')
            ->join('classifications_data', 'classifications.id', 'classifications_data.classification_id')
            ->select('classifications.*', 'classifications_data.title', 'classifications_data.lang_id',)
            ->where('classifications_data.lang_id', Lang::getSelectedLangId())
            ->get();

        $stores = User::query()->get()->pluck('name', 'id');
        $attributes = Attribute::query()
            ->with([
                'Data',
                'Options.translation'
            ])->get();
---
select * from `categories` order by `level` asc
select `brands`.`id`, `brands_data`.`name` from `brands` inner join `brands_data` on `brands`.`id` = `brands_data`.`brand_id` where `lang_id` = 2
select `classifications`.*, `classifications_data`.`title`, `classifications_data`.`lang_id` from `classifications` inner join `classifications_data` on `classifications`.`id` = `classifications_data`.`classification_id` where `classifications_data`.`lang_id` = 2
select * from `attributes`