app/Modules/Admin/Models/Products/products.php

select * from `discount_products` where `product_id` is null limit 1
select * from `discounts` where `id` = 210 limit 1
select * from `discount_products` where `discount_products`.`product_id` = 1 and `discount_products`.`product_id` is not null and `product_id` = 1
---
    public function discounts($product)
    {
        $value = null;
        $pro  = DiscountProduct::where('product_id', null)->first();
        $all  = Discount::where('id', $pro->discount_id)->first();
        $dtt  = new DateTime($all->start_date);
        $edd  = new DateTime($all->end_date);
        if ($all->active == 1 &&   $dtt->format('Y-m-d') <= Carbon::now() && $edd->format('Y-m-d') > Carbon::now()) {
            $value = $all;
        }

        $p = $this->hasMany(DiscountProduct::class, 'product_id', 'id')->where('product_id', $product->id);
        foreach ($p->get() as $discount) {