app/Modules/Admin/Controllers/AdminLoginController.php

    public function login()
    {
        $settings = Setting::
        Join('settings_data', 'settings.id', 'settings_data.setting_id')
            ->select(
                'settings_data.id as id',
                'settings_data.title as title',
                'settings.id as setting_id',
                'settings_data.lang_id as lang_id',
                'settings.logo as logo',
                'settings.facebook_url as facebook_url',
                'settings.twitter_url as twitter_url',
                'settings.instagram_url as instagram_url')
            ->where('settings_data.lang_id', Lang::getSelectedLangId())->first();
---
select `settings_data`.`id` as `id`, `settings_data`.`title` as `title`, `settings`.`id` as `setting_id`, `settings_data`.`lang_id` as `lang_id`, `settings`.`logo` as `logo`, `settings`.`facebook_url` as `facebook_url`, `settings`.`twitter_url` as `twitter_url`, `settings`.`instagram_url` as `instagram_url` from `settings` inner join `settings_data` on `settings`.`id` = `settings_data`.`setting_id` where `settings_data`.`lang_id` = 1 limit 1