app/Modules/Admin/Controllers/DashboardController.php

    public function index()
    {

        $settings = Setting::
        leftJoin('settings_data', 'settings.id', '<=', 'settings_data.id')
            ->select(
                'settings_data.id as id',
                'settings_data.title as title',
                'settings.id as setting_id',
                'settings_data.lang_id as lang_id',
                'settings.logo as logo',
                'settings.facebook_url as facebook_url',
                'settings.twitter_url as twitter_url',
                'settings.instagram_url as instagram_url')
            ->where('settings_data.lang_id', Lang::getLang(session('locale')))

            ->first();

        $users = User::query()->where('guard', 'web')->get()->count();
---
select * from `users` where `guard` = 'web'