app/Modules/Orders/Controllers/orders/OrdersController.php

	public function index()

	{
		$section =  orders::query()
			->join('transactions', 'orders.id', 'transactions.order_id')
			->select('orders.*')
			->get();
---
select `orders`.* from `orders` inner join `transactions` on `orders`.`id` = `transactions`.`order_id`

				// })
				->addColumn('user', function ($query) {

					$user = DB::table('users')->where('id', $query->user_id)->first();
---
select * from `users` where `id` = 1 limit 1

				})
				->addColumn('user_image', function ($query) {

					$user = DB::table('users')->where('id', $query->user_id)->first();
---
select * from `users` where `id` = 1 limit 1

					//						$text .= "<label class='label label-danger'>"._i('Updated')."</label>";
					//					}
					//					return $text;
					$section = orders::join('order_statuses', 'orders.order_status', 'order_statuses.id')->select('order_statuses.code')
						->where('orders.id', $query->id)
						->first();
---
select `order_statuses`.`code` from `orders` inner join `order_statuses` on `orders`.`order_status` = `order_statuses`.`id` where `orders`.`id` = 1 limit 1


		$transtransaction_types = transaction_types::get();
//		dd($transtransaction_types);
		$shipping_option = Shipping_option::get();
---
select * from `shipping_options`